In [2]:
import pandas as pd
import numpy as np

In [11]:
data_4 = pd.DataFrame({"data1":np.random.randn(5),"data2":np.random.randn(5)})
data_4

      data1     data2
0 -0.017741  0.122131
1  0.256225 -2.014212
2 -0.026309  0.007266
3  1.965438  1.209343
4 -0.267621  0.216286

In [17]:
data3 = data_4.assign(r = data_4["data1"]/data_4["data2"])
data3

      data1     data2         r
0 -0.017741  0.122131 -0.145260
1  0.256225 -2.014212 -0.127208
2 -0.026309  0.007266 -3.620684
3  1.965438  1.209343  1.625212
4 -0.267621  0.216286 -1.237346

In [20]:
ages = [15,25,45,25,69,89,63,78]
bins_res = pd.cut(ages,[10,40,80])
bins_res

[(10, 40], (10, 40], (40, 80], (10, 40], (40, 80], NaN, (40, 80], (40, 80]]
Categories (2, interval[int64]): [(10, 40] < (40, 80]]

In [21]:
pd.value_counts(bins_res)

(40, 80]    4
(10, 40]    3
dtype: int64

In [22]:
group_names = ["Young","Adults","Olds"]
pd.value_counts(pd.cut(ages,[10,20,50,80], labels=group_names))

Olds      3
Adults    3
Young     1
dtype: int64

In [23]:
data6 = pd.DataFrame([range(3),[0,np.nan,0],[0,0,np.nan],range(3)])
data6

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [25]:
data6.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [28]:
data6.isnull().any()

0    False
1     True
2     True
dtype: bool

In [29]:
data6.isnull().any(axis=1)

0    False
1     True
2     True
3    False
dtype: bool

In [30]:
data6.fillna(5)

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0